
  #### gcfr results:

  <details><summary>Terraform Fmt: <code>success</code></summary><br>

  ```

  
  ```

  </details>

  <details><summary>Terraform Plan: <code>success</code></summary><br>

  ```

  module.google_kubernetes_cluster.google_container_cluster.primary: Refreshing state... [id=projects/gcfr-352018/locations/europe-west3/clusters/gcfr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.google_kubernetes_cluster.google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ cluster_ipv4_cidr           = "10.0.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "34.159.89.97" -> (known after apply)
      ~ id                          = "projects/gcfr-352018/locations/europe-west3/clusters/gcfr" -> (known after apply)
      - initial_node_count          = 0 -> null
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.22.8-gke.202" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
      ~ name                        = "gcfr" -> "gcfr-test" # forces replacement
      - network                     = "projects/gcfr-352018/global/networks/default" -> null # forces replacement
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_version                = "1.22.8-gke.202" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/gcfr-352018/locations/europe-west3/clusters/gcfr" -> (known after apply)
      ~ services_ipv4_cidr          = "10.3.240.0/20" -> (known after apply)
      - subnetwork                  = "projects/gcfr-352018/regions/europe-west3/subnetworks/default" -> null
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      ~ addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          ~ network_policy_config {
              ~ disabled = true -> (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      ~ cluster_autoscaling {
          ~ enabled = false -> (known after apply)

          + auto_provisioning_defaults {
              + image_type      = (known after apply)
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      ~ database_encryption {
          + key_name = (known after apply)
          ~ state    = "DECRYPTED" -> (known after apply)
        }

      ~ default_snat_status {
          ~ disabled = false -> (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
        }

      ~ logging_config {
          ~ enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> (known after apply)
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQU92YUV3SUdCUnNTS245UFlLNHBsVmN3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa01qUmtNRFZpWkdNdE5tUm1NUzAwTVdVeUxUbGxOakl0TldNd016ZzFaRGMxTVdZMQpNQ0FYRFRJeU1EWXlOVEV3TkRneU5sb1lEekl3TlRJd05qRTNNVEUwT0RJMldqQXZNUzB3S3dZRFZRUURFeVF5Ck5HUXdOV0prWXkwMlpHWXhMVFF4WlRJdE9XVTJNaTAxWXpBek9EVmtOelV4WmpVd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FEYWl3VzFxTTFRaXAwcVNhZVQ5L0ROQXhNQmNaU3hKaHVYcEhsawpRWjF0RmNoZWZDRVJwOTFUeGwreDZLQnRncENYczIvWXMwaXNMdlNKTXBBd0hqck9LL2pFYVVNSllwdFlLL1RnClBzbTlCazV0QkRuc05sYUFHL1p1SjhidzNHcnUvNkY3bE81ZVc5eldpL1JQVzRNR2hFMWJKKzVKNE1QeDVsYlQKSnBHRkJYYlNFN2EyNFNlR2hRNzQwRFo4QUxsZ2c2RzUyS0tNQWVaTk9rdlo0NUdZM2VQbDZMUzNvRGVyazM2NgpYY2tZUTBvbGlaZHhCMm9hRkV0WWd1eXNtMHBuYWpqeUtTUTJVQjFhbWQ1UlA5OWI4aVhNMHZDVWdBSTlMNTQ5CjV0RkcrNm9ZWmdnUnBpNkNFZ0d4ejFhdTF1dFdCSlRqdXVrY0NPVS9PY2loakh4Vyt5L2pZZ1FaZ0U5d1JXNG8KRUhQY010eG0zQm5BeWg4MyszOWEyZUZaWnlzd2U1WU5mWEZJbjhZZitQaW13OE1zc1JNNm5KVS90djdBRjkvVApwck5KMEpwL29nMVh0UzhuTlRvOXAxdTVkU0VyN2R3aU1DOCtYK1YwR1lVaU1JZ1J5cnI1bmdiL1c4NThnRFEyCm5vZThhbXF1aDY2bzVaUmJVMmE2UFBWWU1KY0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGQWNsYW1RVHI1RWYvRWNUcnNhOGNxQWMrcDlCTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQXZTcnl3V2UvSjJ2MHhHR0diVStBQ3l5VFhydUZxYUwybFB0YXV0MUlBCmtqckEwNURSQTBiaVhDYk9HbytxOGs0OHFiV2NVd3lOUERWQWx0dW9OaDdRdC9ZZk1mSHYyVFFRVGVxVFYwYlkKNG43NGhEbUJ3NGpoWnUvTjhDeU5QbU9zLzYyekp2QmhlNkQ4ZzRrVzY4UE9XL3hXS2llRC9EYjlSWTZiNkRYRwp2cFR1dkhNTWJ2alRBWFBOVWp6Sk1UaHpsaW9YTEFROUpBbW5FU1NsQ2tIUldZNXoxZlJvWDlFZnJ3VEpsc1pKCi8zT0E3ZFNZZDh1QkhJZmxOSU50c3l6STNKNVdENTZXWUZVWWdxUVJHZ21KR205OWNIcWVjMk9mZWtMVy9ubmsKUzR3VDdKQ0JyMDhrdndiWWpZSDNqWWk0WVRrYlROeHNKWHNRQUMxdFdSK2gyWWdzU2NkMWQvcWFXdmw1WGFGYgorbklBTTBZc21Ba2RoSXNzajlHOVZBQU9NL1NwU2tLaVA0K3RpTHhuOWFzZHBHSWE0Z1YvVW1nR3dydmNoWEhDCmd4SWVLVTIwQm9XSDNqcHkreUhJYTJjRUNueEVOTjFyK251MW10YmFJbGRUSGVwc2p1VmlWa1ZxYlM5R0ZFdXoKWFowUjd3cVNGVmp1TzFBTHB6bDB4SEU9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

          ~ client_certificate_config {
              ~ issue_client_certificate = false -> (known after apply)
            }
        }

      ~ monitoring_config {
          ~ enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> (known after apply)
        }

      ~ network_policy {
          ~ enabled  = false -> (known after apply)
          ~ provider = "PROVIDER_UNSPECIFIED" -> (known after apply)
        }

      ~ node_config {
          + boot_disk_kms_key = (known after apply)
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-small" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          + node_group        = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> (known after apply)
          ~ preemptible       = false -> (known after apply)
          ~ service_account   = "default" -> (known after apply)
          ~ tags              = [] -> (known after apply)
          ~ taint             = [] -> (known after apply)

          + gcfs_config {
              + enabled = (known after apply)
            }

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      ~ node_pool {
          ~ instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/gcfr-352018/zones/europe-west3-a/instanceGroupManagers/gke-gcfr-default-pool-e3d5c7ad-grp",
            ] -> (known after apply)
          ~ managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/gcfr-352018/zones/europe-west3-a/instanceGroups/gke-gcfr-default-pool-e3d5c7ad-grp",
            ] -> (known after apply)
          ~ max_pods_per_node           = 0 -> (known after apply)
            name                        = "default-pool"
          + name_prefix                 = (known after apply)
          ~ node_count                  = 1 -> (known after apply)
          ~ node_locations              = [
              - "europe-west3-a",
            ] -> (known after apply)
          ~ version                     = "1.22.8-gke.202" -> (known after apply)
            # (1 unchanged attribute hidden)


          ~ node_config {
              ~ disk_size_gb      = 100 -> (known after apply)
              ~ disk_type         = "pd-standard" -> (known after apply)
              ~ guest_accelerator = [] -> (known after apply)
              ~ labels            = {} -> (known after apply)
              ~ local_ssd_count   = 0 -> (known after apply)
              ~ metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> (known after apply)
              ~ oauth_scopes      = [
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                ] -> (known after apply)
              ~ service_account   = "default" -> (known after apply)
              - tags              = [] -> null
              ~ taint             = [] -> (known after apply)
                # (3 unchanged attributes hidden)

              ~ shielded_instance_config {
                  ~ enable_integrity_monitoring = true -> (known after apply)
                  ~ enable_secure_boot          = false -> (known after apply)
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          ~ upgrade_settings {
              ~ max_surge       = 1 -> (known after apply)
              ~ max_unavailable = 0 -> (known after apply)
            }
            # (1 unchanged block hidden)
        }


      + workload_identity_config {
          + workload_pool = (known after apply)
        }
        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>
